benchmarks/results/2026-08-29-710-verification/raw/_matrix_log.txt
>>> before-off-keepalive /root/bench/tardi-before off 0 keepalive 15
=== before-off-keepalive done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.54ms    1.28ms  14.48ms   71.55%
    Req/Sec     1.07k    94.06     1.22k    66.17%
  Latency Distribution
     50%    7.36ms
     75%    8.24ms
     90%    9.21ms
     99%   11.44ms
  63651 requests in 15.01s, 34.42MB read
Requests/sec:   4239.86
Transfer/sec:      2.29MB

>>> before-off-close /root/bench/tardi-before off 0 close 15
=== before-off-close done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.31ms    1.50ms  20.37ms   69.86%
    Req/Sec     0.96k    92.03     1.20k    60.50%
  Latency Distribution
     50%    8.20ms
     75%    9.24ms
     90%   10.24ms
     99%   12.43ms
  57164 requests in 15.02s, 30.64MB read
Requests/sec:   3806.23
Transfer/sec:      2.04MB

>>> before-response-keepalive /root/bench/tardi-before response 0 keepalive 15
=== before-response-keepalive done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.69ms    2.55ms  33.92ms   69.77%
    Req/Sec   822.19     41.33     0.93k    69.50%
  Latency Distribution
     50%    9.50ms
     75%   11.26ms
     90%   12.98ms
     99%   16.52ms
  49116 requests in 15.01s, 27.22MB read
Requests/sec:   3272.69
Transfer/sec:      1.81MB

>>> before-response-close /root/bench/tardi-before response 0 close 15
=== before-response-close done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.11ms    1.65ms  18.15ms   70.14%
    Req/Sec     0.87k    55.02     1.00k    60.50%
  Latency Distribution
     50%    8.94ms
     75%   10.08ms
     90%   11.27ms
     99%   13.81ms
  52228 requests in 15.01s, 28.94MB read
Requests/sec:   3479.30
Transfer/sec:      1.93MB

>>> before-static /root/bench/tardi-before off 0 keepalive 10 /health
=== before-static done ===
Running 10s test @ http://127.0.0.1:8069/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   623.60us  383.16us   8.92ms   83.01%
    Req/Sec    13.20k     1.00k   19.76k    74.44%
  Latency Distribution
     50%  551.00us
     75%  754.00us
     90%    1.02ms
     99%    2.09ms
  529094 requests in 10.10s, 293.64MB read
Requests/sec:  52388.69
Transfer/sec:     29.08MB

>>> after-off-keepalive /root/bench/tardi-after off 0 keepalive 15
=== after-off-keepalive done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.64ms   25.03ms 314.73ms   98.17%
    Req/Sec     1.06k   119.67     1.24k    88.51%
  Latency Distribution
     50%    7.42ms
     75%    8.28ms
     90%    9.27ms
     99%  163.78ms
  62471 requests in 15.03s, 33.78MB read
Requests/sec:   4155.52
Transfer/sec:      2.25MB

>>> after-off-close /root/bench/tardi-after off 0 close 15
=== after-off-close done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.25ms    1.59ms  32.51ms   74.52%
    Req/Sec     0.97k    83.24     1.19k    66.33%
  Latency Distribution
     50%    8.13ms
     75%    9.09ms
     90%   10.07ms
     99%   12.37ms
  57681 requests in 15.01s, 30.91MB read
Requests/sec:   3841.59
Transfer/sec:      2.06MB

>>> after-response-keepalive-r1 /root/bench/tardi-after response 0 keepalive 15
=== after-response-keepalive-r1 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.35ms    1.46ms  17.83ms   70.71%
    Req/Sec     0.96k    72.45     1.13k    66.17%
  Latency Distribution
     50%    8.18ms
     75%    9.19ms
     90%   10.26ms
     99%   12.57ms
  57464 requests in 15.01s, 32.11MB read
Requests/sec:   3829.17
Transfer/sec:      2.14MB

>>> after-response-keepalive-r2 /root/bench/tardi-after response 0 keepalive 15
=== after-response-keepalive-r2 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.27ms    2.02ms  49.64ms   82.34%
    Req/Sec     0.87k    49.00     1.01k    72.17%
  Latency Distribution
     50%    9.04ms
     75%   10.11ms
     90%   11.27ms
     99%   13.99ms
  51963 requests in 15.01s, 29.04MB read
Requests/sec:   3462.32
Transfer/sec:      1.93MB

>>> after-response-keepalive-r3 /root/bench/tardi-after response 0 keepalive 15
=== after-response-keepalive-r3 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.83ms    1.31ms  16.69ms   71.30%
    Req/Sec     1.03k    62.05     1.14k    69.67%
  Latency Distribution
     50%    7.68ms
     75%    8.57ms
     90%    9.53ms
     99%   11.72ms
  61261 requests in 15.01s, 34.23MB read
Requests/sec:   4081.78
Transfer/sec:      2.28MB

>>> after-response-close /root/bench/tardi-after response 0 close 15
=== after-response-close done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.26ms    1.42ms  16.96ms   70.09%
    Req/Sec     0.96k    34.10     1.06k    66.67%
  Latency Distribution
     50%    8.13ms
     75%    9.10ms
     90%   10.11ms
     99%   12.26ms
  57559 requests in 15.01s, 31.89MB read
Requests/sec:   3834.65
Transfer/sec:      2.12MB

>>> after-static /root/bench/tardi-after off 0 keepalive 10 /health
=== after-static done ===
Running 10s test @ http://127.0.0.1:8069/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   652.14us    1.24ms  36.63ms   98.20%
    Req/Sec    14.07k     1.44k   18.51k    72.21%
  Latency Distribution
     50%  512.00us
     75%  720.00us
     90%    0.99ms
     99%    2.72ms
  563886 requests in 10.10s, 312.95MB read
Requests/sec:  55819.91
Transfer/sec:     30.98MB

>>> before-response-keepalive-w32 /root/bench/tardi-before response 32 keepalive 15
=== before-response-keepalive-w32 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.76ms   83.21ms   1.26s    98.45%
    Req/Sec     0.91k   119.82     1.28k    83.67%
  Latency Distribution
     50%    7.51ms
     75%   11.45ms
     90%   16.31ms
     99%  459.57ms
  54643 requests in 15.01s, 30.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:   3640.31
Transfer/sec:      2.02MB

>>> before-response-close-w32 /root/bench/tardi-before response 32 close 15
=== before-response-close-w32 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.80ms  185.97ms   1.86s    95.30%
    Req/Sec     0.92k   243.05     2.58k    92.89%
  Latency Distribution
     50%    8.06ms
     75%   12.31ms
     90%   19.04ms
     99%    1.10s 
  54446 requests in 15.01s, 30.18MB read
Requests/sec:   3626.68
Transfer/sec:      2.01MB

>>> after-response-keepalive-w32 /root/bench/tardi-after response 32 keepalive 15
=== after-response-keepalive-w32 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.60ms  178.05ms   1.87s    95.42%
    Req/Sec     0.96k   158.73     1.70k    89.49%
  Latency Distribution
     50%    7.88ms
     75%   11.68ms
     90%   17.85ms
     99%    1.07s 
  56577 requests in 15.01s, 31.62MB read
Requests/sec:   3769.85
Transfer/sec:      2.11MB

>>> after-response-close-w32 /root/bench/tardi-after response 32 close 15
=== after-response-close-w32 done ===
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.80ms  121.82ms   1.27s    96.78%
    Req/Sec     0.94k   189.54     2.33k    90.85%
  Latency Distribution
     50%    7.78ms
     75%   11.73ms
     90%   17.18ms
     99%  807.75ms
  55516 requests in 15.01s, 30.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:   3697.67
Transfer/sec:      2.05MB