benchmarks/results/2026-08-29-710-verification/raw/wrk-after-off-keepalive.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.64ms   25.03ms 314.73ms   98.17%
    Req/Sec     1.06k   119.67     1.24k    88.51%
  Latency Distribution
     50%    7.42ms
     75%    8.28ms
     90%    9.27ms
     99%  163.78ms
  62471 requests in 15.03s, 33.78MB read
Requests/sec:   4155.52
Transfer/sec:      2.25MB