benchmarks/results/2026-08-29-710-verification/raw/wrk-before-response-close-w32.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.80ms  185.97ms   1.86s    95.30%
    Req/Sec     0.92k   243.05     2.58k    92.89%
  Latency Distribution
     50%    8.06ms
     75%   12.31ms
     90%   19.04ms
     99%    1.10s 
  54446 requests in 15.01s, 30.18MB read
Requests/sec:   3626.68
Transfer/sec:      2.01MB