benchmarks/results/2026-08-29-710-verification/raw/wrk-before-response-close.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.11ms    1.65ms  18.15ms   70.14%
    Req/Sec     0.87k    55.02     1.00k    60.50%
  Latency Distribution
     50%    8.94ms
     75%   10.08ms
     90%   11.27ms
     99%   13.81ms
  52228 requests in 15.01s, 28.94MB read
Requests/sec:   3479.30
Transfer/sec:      1.93MB