benchmarks/results/2026-08-29-710-verification/raw/wrk-before-response-keepalive-w32.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.76ms   83.21ms   1.26s    98.45%
    Req/Sec     0.91k   119.82     1.28k    83.67%
  Latency Distribution
     50%    7.51ms
     75%   11.45ms
     90%   16.31ms
     99%  459.57ms
  54643 requests in 15.01s, 30.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:   3640.31
Transfer/sec:      2.02MB