benchmarks/results/2026-08-29-710-verification/raw/wrk-before-response-keepalive.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.69ms    2.55ms  33.92ms   69.77%
    Req/Sec   822.19     41.33     0.93k    69.50%
  Latency Distribution
     50%    9.50ms
     75%   11.26ms
     90%   12.98ms
     99%   16.52ms
  49116 requests in 15.01s, 27.22MB read
Requests/sec:   3272.69
Transfer/sec:      1.81MB